const { EmbedBuilder, Colors } = require("discord.js");
const { prefix } = require(`${process.cwd()}/config`);

module.exports = {
  name: "advice",
  description: "Send helpful tips for server security and community management.",
  usage: ` advice`,
  run: async (client, message) => {
    const embed = new EmbedBuilder()
      .setColor(Colors.Blue)
      .setTitle("نصائح يمكن أن تفيدك")
      .setDescription("إليك بعض النصائح لتجنب الجحفلة والحفاظ على أمان مجتمعك:")
      .addFields(
        { name: "🚫 تجنب إعطاء الصلاحيات:", value: "لا تعطي أي صلاحيات أو رولات لأشخاص لا تعرفهم جيدًا. تأكد من معرفة الشخص قبل منحه أي صلاحيات." },
        { name: "🔒 تفعيل الحماية:", value: "تأكد من تفعيل جميع إعدادات الحماية المتاحة في السيرفر لحماية مجتمعك." },
        { name: "👁️‍🗨️ مراقبة الصلاحيات:", value: "عند إعطاء صلاحيات لأعضاء، تأكد من مراجعة الصلاحيات الممنوحة بعناية لتجنب أي مشاكل." },
        { name: "⚠️ تجنب الجحفلة:", value: "كن حذرًا عند إدخال أي تعديلات على إعدادات السيرفر وتجنب جميع أشكال الجحفلة." },
        { name: "🛡️ تذكر:", value: "دائمًا تحقق من إعدادات الأمان في السيرفر وكن حذرًا من الأعضاء الجدد." },
      )
      .setFooter({ text: "حافظ على مجتمعك آمنًا" });

    return message.channel.send({ embeds: [embed] });
  },
};
